# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable..::..Clear Method
ExportLineweightTable Class See Also
---
Removes all contents stored in Export line weight table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace